[
  {
    "File": "screenshots/IMG_1391.PNG",
    "Text": "no. after the article you were a part of for the quest, and lack of changes even after numerous people left detailed comments describing what should be changed, you aren't fit to be a quest editor unless you do some serious soul searching. the article insinuating the protests for palestine are antisemetic is extremely disappointing. frankly,im disgusted at the neutral position the article took in covering a protest for liberation. if you think that was good journalism you should not be a journalist until you re- evaluate whether you will fight for liberation or cling to neutrality and side with opressors",
    "Type": "Personal"
  },
  {
    "File": "screenshots/IMG_1393.PNG",
    "Text": "Reedies have now been made a target of zionist groups. I think its time for an apology. Someone was almost ran over by a jeep today with an Isreal flag and an American flag on the back of it. There have been many Quest apologies in my three years at Reed, and none of them have been for something this drastic. We're all waiting.",
    "Type": "NA"
  },
  {
    "File": "screenshots/IMG_1403.PNG",
    "Text": "This reddit thread has almost 200 comments, most not too different from this. @reedquest Your reporting actually has-- consequences, and you should not be surprised to have brought harm onto this campus",
    "Type": "NA"
  },
  {
    "File": "screenshots/IMG_1404.PNG",
    "Text": "If you want proof of @reedquest actual harm, go ahead and read the comments section below. I am sure they would be shocked to see their disingenuous article being used as right wiing fodder - I am not",
    "Type": "NA"
  },
  {
    "File": "screenshots/IMG_1405.PNG",
    "Text": "Thanks @reedquest for portraying our valid outrage as antisemitic. You have made us a target.",
    "Type": "NA"
  },
  {
    "File": "screenshots/IMG_1410.PNG",
    "Text": "Hey declan, the article you guys published this morning seems to be getting a lot of traction. Do you or any of the people who wrote this article identify as Zionists? If not I would very strongly suggest taking this article down. It falsely paints all the writers as having a Zionist mentality If you guys do identify as being zionists though, I think moving this article into an opinion section would make more sense categorically",
    "Type": "Named"
  },
  {
    "File": "screenshots/Screenshot 2023-11-11 at 3.39.08 PM.png",
    "Text": "Declan, Adrian, and Sam, respectfully, this shit sounds like someone with a Prager university education wrote it. I fear you have not spoken to one Palestinian or one Palestinian student for this article. You have not listened to us cry out for the genocide to stop. it's not even a unreasonable fucking ask. Stop the ethnic cleansing. Respect the existence of Palestinians and their right to a sovereign nation. Y'alls inability to grasp that is actually beyond me. Your obsession with us is predatory and degenerate. | should not have to beg and plead with my fellow students to recognize my people, especially not at Reed. I should not have to be subject to scrutiny by my peers for being politically active in my opposition to the active genocide of my people. The WHO director general said, on average, every ten minutes a child is killed in Gaza. Israel is killing our future. Al-Shifa hospital was attacked with R9x hellfire missiles. 21 out of 35 of Gazas hospitals are not functioning due to attack. Children are being operated on without anesthetic. Salt and vinegar are being used for antiseptic. Iphone flashlights are being used to do surgery because electricity has been cut off. WHY AREN'T YOU REPORTING ON THAT? YOU SHOULD FUCKING BE REPORTING ON THAT IF YOU WANT TO BE SO FUCKING SERIOUS IN YOUR JOURNALISM RUNNING AROUND IN YOUR FUCK ASS \"PRESS\" ORANGE TAPE FILMING US FROM ACROSS THE STREET!! Instead of being cheap and just quoting our chants and citing one source for the definition of one word, do some soul searching and find humanity. | in no way think yall are oblivious to the horrors, you all are very intelligent and learned people. You have made a conscious decision not to report on them and tell that side of the story. This is tragic. Do you stand for nothing? There's so much more to say but | can’t keep saying it anymore. I'm so fucking sick of having to be reminded of the horrors. It is draining. As you mentioned in the article, one of the SJP leaders said “Reedies take care of Reedies.\"” Declan, Adrian, and Sam this article did not take care of Reedies and shame on you for that. Find whatever you believe in and ask for forgiveness in forgetting to mention the names of the Palestinians who have died- in choosing not to report on whose behalf we were showing up for. https://www.aljazeera.com/news/longform/2023/11/1/know-their-names-palestinians-killed-in-israeli-attacks-on-gaza Last but in no way least important point, your allusions to antisemitism are repulsive. In no way is Palestinian liberation anti semitic. I vehemently condemn any association of the sort. Your insinuations are misguided and nefarious. Honesty, please just be so fucking for real with this shit and find God.",
    "Type": "Named"
  },
  {
    "File": "screenshots/Screenshot 2023-11-12 at 3.19.56 PM.png",
    "Text": "Welp, I know plenty of people have been excited for Declan to finally be gone from the editorial board. Looks like their wishes are going to be granted next election cycle.",
    "Type": "Named"
  },
  {
    "File": "screenshots/Screenshot 2023-11-12 at 3.20.48 PM.png",
    "Text": "The quest = fried",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-11-13 at 1.39.29 PM.png",
    "Text": "Hey | found something you guys might want to look into. Lots of opportunities for people with your journalistic skills. https://www.breitbart.com/jobs/",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-11-13 at 2.45.41 PM.png",
    "Text": "fuck @reedcollege AND @reedquest FOR THIS NASTY EMAIL AND ARTICLE #FromTheRiverToTheSea #DeathToColonialism THIS SHITTY ATTEMPT AT AN \"APOLITICAL' STANCE DISRESPECTS THE TENS OF THOUSANDS OF PALESTINANS MURDERED IN ISRAEL'S GENOCIDE",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-11-16 at 1.13.00 PM.png",
    "Text": "I don't want you to think that I'm blaming you for this or anything like that, but I'm genuinely curious. How the fuck did Declan's piece get published, why is he still on the board, and why have | heard that it's going to print?",
    "Type": "Named"
  },
  {
    "File": "screenshots/Screenshot 2023-11-20 at 12.40.00 PM.png",
    "Text": "Have you been horrified with the Quest lately?? Been confused and wanting actually informative and nuanced articles instead of whatever one sided poorly written biased garbage has been circulating lately? I know I have! That's why I’m voting Louis for Quest!!",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-11-20 at 12.40.16 PM.png",
    "Text": "hey everyone! my name is sophia lenczowski and I'm running for quest editor candidacy in this upcoming sb election :)) I'm super passionate about this and I really want to help transform the Quest into a platform that truly reflects the values and perspectives of our student body. here is the link to my form, take a gander and see what you think. thanks in advance! <3",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-11-20 at 12.41.29 PM.png",
    "Text": "Quest gonna keep taking L's till they get rid of their biased whacked out journalists and stop supporting war. I hope the Quest goes the way of beer nation and the dodo bird afterp ublishing their own silly \"What I Know\" response nobody wanted. Keep it up with the nerd whiny cope you war crime apologist",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-11-20 at 12.41.52 PM.png",
    "Text": "Dear Quest editors, From the moment the rally started and you all were running around with that tape on your jackets, it was pretty clear that you understood this protest only as something that could become a threat to your safety, and that you weren't willing to cover the actual content of the protest, just the scandal that would arise from it. Now you're saying that our \"feelings of betrayal,” which are totally justified and arose from your own coverage, are making you feel unsafe- what do you want us to do? Just forgive you for your biased reporting so you can go back to demonizing the student body with impunity? I'm confused as to what you expect. Your fear is clearly very real, and your fear isn't your fault, but what it is is your responsibility to face. Right now, you're using that fear offensively to ostracize students for threats of violence that haven't been made, and for violent actions that haven't happened (at least, as far as you've reported). Hence, our betrayal, and your fear. We expected that a student publication covering their fellow students would write an accurate account of the protest's events, not a poorly-disguised opinion piece in the vague shape of a partial truth. All these students want is for you to own up to this mistake and to issue a proper apology, but it seems as though you would rather rebuff these requests to uphold your fictional standard and cling to your fear than heal this rift. For the record, your \"standard\" doesn't seem to have anything against lies of omission. | have yet to see any statements from the Quest, its individual editors and writers notwithstanding, that mentioned that after the police issued their dispersal order, a good majority of the people occupying the skywalk immediately vacated the area. I've also not seen one that mentioned the content of Reed students’ speeches at the protest. You'd think that a publication that presents itself as present and attentive would cover this. As one editor wrote in your letter published this Friday, this only represents a small portion of your readers’ grievances, but | for one expect you to address it nonetheless, since you hold yourself to \"the highest standard of journalistic practice.\" Your reputation precedes you. For the Drag-Race-inclined among you: DON'T BE LAGANJA, guys. | get that you're feeling very attacked right now, but Discord/MC whining and letters to the editor don't constitute anything of the sort.",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-11-20 at 12.42.10 PM.png",
    "Text": "you: can see who wrote that evil quest article don't: vote them for quest editor",
    "Type": "Personal"
  },
  {
    "File": "screenshots/Screenshot 2023-11-20 at 12.42.25 PM.png",
    "Text": "(3/3) In conclusion, I don't think I've ever voted in Quest Editor elections, but I sure as hell will be voting this year to make sure that the Quest undergoes some changes. I hope every student who was as disturbed by that article as I was will attend the Elections Assembly and ask candidates the important questions. My question to the people who are currently running to be a Quest Editor: Can you promise the student body that you will do better? How will you address biases going forward?",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-11-20 at 12.42.42 PM.png",
    "Text": "when I’m in a VICTIMIZING MYSELF competition and my opponent is THE QUEST",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-11-20 at 12.50.14 PM.png",
    "Text": "oh yeah, i wouldn't be surprised if a lot of this originates from all the negative/false portrayal of SJP in the quest and audrey's email",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-11-20 at 3.29.11 PM.png",
    "Text": "re the quest. your recent article on the 11/9 walkout is incredibly biased and misrepresentative of so many things i'm baffled. not only do you NOT interview a professor equipped on lecturing on middle eastern relations, you blatantly ask leading questions and act surprised when the sjp addressed antisemitism in their response. you were not the only ones seeing the walkout, nor were you the only ones at the protest. to use antisemitism as a means of attacking the movement is atrocious. as a jew, i am so incredibly offended by this use of our trauma as a means to support a genocidal campaign. do better.",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-11-20 at 3.29.26 PM.png",
    "Text": "the quest would call vietnam genocidal for trying to free itself from french colonial occupation",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-11-20 at 3.30.28 PM.png",
    "Text": "CALLING FOR THE QUEST TO OFFICIALLY RESCIND THEIR ARTICLE RE STUDENT PROTESTS AND SUBMIT AN APOLOGY. The original, printed article can be found below. https://web.archive.org/web/20231111080142/https://reedquest.org/2023/11/11/reed-college-prot est-ends-in-four-student-arrests-demonstrators-chant-globalize-the-intifada/ This is a poorly-written, unacceptably biased work of fiction. It fails to follow the policies the current Quest team describes, which in itself have several flaws: https://reedquest.org/the-magazine-2/ Although some edits were made to the snapshot attached above, this was only after it's print and distribution around campus. IT STILL PORTRAYS THE STUDENT PROTESTORS AS ANTISEMITIC, and heavily cherry picks the slogans they chose to quote and the photos they chose to take. Drawing focus away from Palestinian genocide through a distinctly Zionist lens is unacceptable. | was going to send a questionnaire to gauge how many students wanted this article taken down (and still might), but reading the comments on the online article answers that question. Student opinions voiced anonymously make it incredibly obvious that this article an embarrassment to Reed's journalistic legacy, and should NOT be allowed to represent the student body - see below for some excerpts. \"It really says something that you initially cited Israeli deaths and “societal devastation” but not Palestinian... This is an accountability dodge, plain and simple.\" - Anonymous Reedie \"It's obvious you're not willing to consider why students are concerned about the current genocide occurring on Palestinian soil or why protesting against that injustice isn’t an attack on Jewish people. As a Jew I’m ashamed to be associated with this and I’m incredibly frustrated to watch people weaponize our trauma to justify colonialism. Shame on you.\" - Acacia",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-11-20 at 3.33.20 PM.png",
    "Text": "Dear: Quest Please: Own up to your actions You: Need to acknowledge that you have made people feel uncomfortable You: Have published a very one-sided article as \"truth\" instead of an opinion piece You: Used to publish apologies when you fucked up What: Happened? When: Did you stop seeing your sources as humans? When: Did you start saying \"support truth” as a media source You: Need to realize that the press is not the \"truth\" unless you show both sides You: Published an article about SJP without SJP's statement and not even due to printing You: Wrote an article about a protest without reporting on WHY people were protesting It's: Time to realize your actions have consequences You: Should say sorry There: have been other instances this semester of people feeling misrepresented by the Quest Peoples: names have been used for your agenda of \"truth\" without their consent It: Is concerning. I'll: get off my soapbox Long story short: You are a newspaper for Reedies by Reedies. If you are not respected by your audience no one will read it. This is not a large newspaper where you can treat your sources like shit, and become famous off of it. People are no longer aware of how to submit to the quest, or how to file a complaint with you. This newspaper is supposed to reflect the student body, but I am seeing you getting flamed more and more. Sometimes people make mistakes, its okay, but its not okay to pretend you have done nothing wrong.",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-14 at 12.29.18 PM.png",
    "Text": "@reedquest If you call this journalism, I swear by Allah that I will shoot myself right here.",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-14 at 12.34.23 PM.png",
    "Text": "The quest tried to do some sort of gotcha piece and they put students lives in danger. What fucking excuse do they have??",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-14 at 12.34.23 PM.png",
    "Text": "Would you rather smoke crack every day or read The Quest once?",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-14 at 9.24.42 AM.png",
    "Text": "“Democracy dies in darkness” “You can try to get rid of me...” Stop it! Stop!!! Stop!",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-17 at 2.00.56 PM.png",
    "Text": "10,000+",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-17 at 2.01.18 PM.png",
    "Text": "I could only get a few paragraphs in before I had to click off. It’s obvious you’re not willing to consider why students are concerned about the current genocide occurring on Palestinian soil or why protesting against that injustice isn’t an attack on Jewish people. As a Jew I’m ashamed to be associated with this and I’m incredibly frustrated to watch people weaponize our trauma to justify colonialism. Shame on you.",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-17 at 2.01.28 PM.png",
    "Text": "Never again means never again. My people were forced off their land because goyim decided that my people didn’t belong there. Our holidays are a timeline of my people’s genocides. Over and over and over again. I will never be able to have sympathy for the people who do that even if they wave a symbol that has come to represent my people, and invoke their name and their trauma. My family did not die so that someone can use their names to justify genocide. From the river to the sea Palestine deserves to be free.",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-17 at 2.01.55 PM.png",
    "Text": "Put as respectfully as possible, this article leaves a lot to be desired. You conveniently left out the reason that the SJP gave you multiple times for not being able to provide comment the same night as the protest: they were ensuring that those who had gotten arrested were safe and made it back alright. You are the only news organization on this campus. There is no need to run stories down as fast as possible like a rabid coyote chasing a toddler. It is okay to take a few days to talk to sources, especially when some of those sources have just risked facing arrest by attending a protest for what they believe in. Also, some much-needed context about the oh-so-bloody-and-antisemitic intifadas talked about here. The first intifada was started after an IDF military vehicle struck a civilian car, killing 4 (civilians), which kicked off general rioting (which was, at first, mostly comprised of nonviolent protests), similar to what we saw in America with the BLM movement. The Israeli government then responded to these protests by deploying 80,000 soldiers within their own borders and escalating the situation into violence. Not riot police, but the national army. The resulting conflict saw a grand total of approximately 200 Israeli and nearly 2,000 Palestinian fatalities. The second of the intifadas, the more violent one, was started because the IDF intentionally opened fire with live ammunition on hundreds of unarmed protesters. But yes, please, by all means, publish more about how the intifada is nothing but bloodlust seeking the death of jews everywhere. I’m aware that you’re quoting an outside source in this article on these events, but my dear friend, you are the ones who chose the source!! Only seeking comment from a single scholar who’s strongly opposed to the message of the protests and then hand-waving all responsibility by saying “Weeeeellll, WE never accused you of being antisemitic...” is naively ignorant at best and downright malicious manipulation of the narrative at worst, particularly if you aren’t willing to do the bare minimum and provide an individual of similar standing with a differing perspective. Please either take more time and consideration when reporting on events as complex as this in the future, or stick to writing articles about the pool hall formal being cancelled.",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-17 at 2.02.08 PM.png",
    "Text": "I'd like to know why The Quest chose to ask a scholar of Soviet Science Fiction about the history and meaning of the word intifada instead of one of the several professors on campus who actually speak Arabic and study the history of the region. https://jewishcurrents.org/forgotten-histories-women-of-the-first-intifada",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-17 at 2.02.28 PM.png",
    "Text": "This is a terrible article dude like how are you going to say that uprising against genocide is anti-Semitic? You’re Saying genocide is pro-Jewish? Come on now. This is an embarrassment to your college",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-17 at 2.02.46 PM.png",
    "Text": "Also stop misgendering people. Basic journalism ethics",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-17 at 2.03.00 PM.png",
    "Text": "Was the Intifada against Jewish lives when it took place against the Iraqi monarchy? Or Spanish colonizers in North Africa? Perhaps asking a scholar of Russian literature about this topic wasn’t the best move...then again this article is filled with nonsensical and tendentious choices like this.",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-17 at 2.03.11 PM.png",
    "Text": "This article is so biased and inflammatory that it is actually insane. Have some journalistic integrity and the ability to see past your narrow and flawed worldview that prioritizes the comfort of a genocidal bureaucratic ethnostate that is younger than some of the people it aims to destroy and whose land it occupies.",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-17 at 2.03.20 PM.png",
    "Text": "You guys should’ve really waited to publish this. Approaching SJP with that question about Kristallnacht was absolutely loaded; you guys came in with the expectation that they would be antisemitic.",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-17 at 2.03.54 PM.png",
    "Text": "Expected much better from the Quest. There are several Middle East scholars working at Reed who would have been able to provide a much more nuanced take on the issue. Speaking as a Jew, I think the sole focus on Jewish suffering in this article is a total misdirection from the innocent civilians in Gaza who are having hellfire rain down on them everyday. I am disgusted by the blatant weaponization of the suffering my ancestors underwent, in order to justify the atrocities committed by the Israeli government. If Palestinian Solidarity Organizations spend all their time washing their hands of baseless allegations of antisemitism- the people of Palestine will never get the support that they desperately need. This is about life and death. Free Palestine!",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-17 at 2.04.19 PM.png",
    "Text": "Extremely disappointed in the Quest. This article is a product of poor journalism, no better way to say it. It uses biased sources and only from one perspective and shows a clear lack of research. Not to mention the rushed timeline of the demands for answers from SJP and multiple demands in a way that’s seems close to harassment. This is not how journalism works and not how Reed students should present themselves as journalists.",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-17 at 2.04.30 PM.png",
    "Text": "this story sucks and you guys suck as journalists. i hope you feel ashamed for supporting the continued genocide of palestinians with this inflammatory article. i’m jewish, i love being jewish. that being said, fuck israel, fuck the quest and fuck imperialism.",
    "Type": "Personal"
  },
  {
    "File": "screenshots/Screenshot 2023-12-17 at 2.04.40 PM.png",
    "Text": "im sorry, you cant seriously think a quote from BRITANNICA is a legitimate academic source to back up these claims...",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-17 at 2.04.48 PM.png",
    "Text": "Frustrating that you acknowledged that you shouldn’t have published that, but you cite Grinberg’s other tweets and refuse to take accountability for the ways in which his statement was disturbing, racially charged, and just fundamentally ahistorical. What about, say, the Iraqi Intifada, the namesake, about violence against Jewish people? It really says something that you initially cited Israeli deaths and “societal devastation” but not Palestinian, when three times more were killed in the second intifada (first was peaceful) and their population was ethnically cleansed, systematically expropriated and impoverished, and funneled into alternatively an open-air prison or a brutal military state where citizens human rights are systematically violated. This is an accountability dodge, plain and simple. The issue was not just Marat Grinberg’s other claims. His statement in itself is very disturbing, and you need to take accountability for approving and publishing it. You are deliberately framing it to try to feign justifiable ignorance.",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-17 at 2.05.00 PM.png",
    "Text": "As a former quest editor, this article is a disgrace.",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-17 at 2.05.37 PM.png",
    "Text": "Marat Grinberg’s comments were insightful and completely true. This campus is so ignorant to Jewish history, I’m appalled that you removed the historical context to Intifada he generously provided. You could easily add the perspective of an Arab professor in addition to his, rather than delete it all and replace it with a shitty Britannica quote. Disappointing that the quest has so quickly succumbed to mindless bullying— as if any of the teenagers in these comments are more knowledgeable about Israel than he is. There are critical thinking skills in sight. Silencing a Jewish expert IS antisemitism. Your actions are shameful and spineless.",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-17 at 2.05.53 PM.png",
    "Text": "this is not the own you think it is!!! standing up against genocide might be the most morally righteous thing anyone can do.",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-17 at 2.06.05 PM.png",
    "Text": "Welp, I know plenty of people have been excited for Declan to finally be gone from the editorial board. Looks like their wishes are going to be granted next election cycle.",
    "Type": "Named"
  },
  {
    "File": "screenshots/Screenshot 2023-12-17 at 2.06.15 PM.png",
    "Text": "incredibly poor and embarassing work. disregarding all of the inflammatory implications of the article and the way it misdirects attention from the actual issue, this is some REALLY bad journalism! 1. Not fact checking your original sources (Prof Marat) quote. 2. Not acknowledging in your addendum that the original “translation” was horribly incorrect and played a major part in your bad-faith argument 3. Replacing it with a Brittanica quote??? Hello??? Speak to one of our multiple middle east scholars. Many of whom speak Arabic? It seems that using a scholar as a source is only worth it when it helps your misguided point. If you guys want to fancy yourself serious journalists, do better. This is not pool formal being canceled, this is a 70+ year history of ethnic cleansing and forced expulsion. Do better or don’t do it at all.",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-17 at 2.06.43 PM.png",
    "Text": "The quest = fried",
    "Type": "NA"
  },
  {
    "File": "screenshots/Screenshot 2023-12-17 at 2.06.59 PM.png",
    "Text": "You guys flopped so hard with this one",
    "Type": "NA"
  },
  {
    "File": "screenshots/test.png",
    "Text": "This is an incredibly biased article. Not only have you misclassified what intifada means — a key term in Arabic meaning revolution/uprising against oppression — you blatantly weaponized Jewish trauma through your leading question of the protest happening to fall on the anniversary of the Kristallnacht. Are you aware that November 9th is also the date the Berlin Wall fell? That on November 10th, the Wilmington Race Riots occurred? As a Jewish student, I am incredibly disappointed with this reporting.",
    "Type": "NA"
  },
  {
    "File": "discord_file.pdf",
    "Text": "🍅🍅🍅 boooo",
    "Type": "Discord"
  },
  {
    "File": "discord_file.pdf",
    "Text": "can you just apologize",
    "Type": "Discord"
  },
  {
    "File": "discord_file.pdf",
    "Text": "your recent article has proven just how flawed your journalism is. not only did you seek out the most biased source of information possible, you refused to allow the counter a voice in a so-called neutral article. ignoring the criticisms we have been giving you all the more proves this. this isnt some action movie, or some hero story. this is a college newspaper",
    "Type": "Discord"
  },
  {
    "File": "discord_file.pdf",
    "Text": "yeah, I don't understand why you've only doubled down instead of issuing a retraction for your coverage of the SJP stuff and apologized. I feel like you should be capable of recognizing your mistakes, listening to genuine criticism, and making amends - I worked with you extensively on the IT story, I know that you're a pretty smart person! but you just aren't doing any of that and it's really disappointing and upsetting, and I've lost so much trust in you",
    "Type": "Discord"
  },
  {
    "File": "discord_file.pdf",
    "Text": "you and sam continue to ignore the valid concerns we have levied, instead placing yourselves at the center of some dramatic spinning of events that did not need to occur in the first place. in vying for getting the story out immediately, you have failed the most basic principles of journalism. speaking the truth and being accountable. we're all disappointed in you tbh",
    "Type": "Discord"
  },
  {
    "File": "discord_file.pdf",
    "Text": "humility is a virtue!",
    "Type": "Discord"
  },
  {
    "File": "discord_file.pdf",
    "Text": "but anyways, continue talking about how you never back down from a challenge or how you dont feel safe on campus and have to carry pepper spray. im sure no one on campus can relate /s",
    "Type": "Personal"
  },
  {
    "File": "discord_file.pdf",
    "Text": "Let's be clear here- people don't want you on the ballot because you did a bad job, end of. People sending you mean messages doesn't mean you deserve to be an editor. You want my signature? Issue a formal apology in the Quest and stop treating yourself like the center of damn universe. P.S. That's not how you use [sic].",
    "Type": "Personal"
  },
  {
    "File": "discord_file.pdf",
    "Text": "“reflect the values of our student body at large” dawg the values of the student body are not to slant the issue to fall in line with mainstream propaganda. you're covering a genocide. neutrality =/= objectivity it's one thing to omit relevant perspectives due to poor priorities and logistical issues, but it takes active bias to cherrypick the way you did. you literally challenged my worldview with this shit because I absolutely always assume people are going in with good intentions. in your case, I have no idea how one could possibly write such an article with the intent to fairly represent opposing perspectives. even if you were gonna bothsides it (it's dubious to use equivocating framing / language when you're covering, ahem, a genocide, anyway) I still cannot imagine how the product would be the article you wrote",
    "Type": "Discord"
  },
  {
    "File": "discord_file.pdf",
    "Text": "deleted a couple more messages bc its only really self indulgent to continue ranting at you. it's been said before",
    "Type": "Discord"
  },
  {
    "File": "discord_file.pdf",
    "Text": "It's astonishing and incredibly privileged that all the authors of the article believe in themselves enough to run for quest editor. The sheer irony of claiming to be \"committed to covering the truth\" after students, faculty, alumni - even parents - have pointed out continued mistakes in your writing is unbelievable. Posting your petition here without a semblance of an apology demonstrates that none of you have learned from your mistakes- which was evident from the updates. If the things you believe in and the behavior you refuse to back down from causes hundreds of people distress and harm, then perhaps you all should seriously reflect on yourselves! People are begging y'all to think critically and with empathy for one second - at least question why you have recieved so much outrage. You have every right to believe in your own ideas about journalism, but the Quest belongs to the student body, who have every right to take it away from you if necessary.",
    "Type": "Discord"
  },
  {
    "File": "Discord copy paste",
    "Text": "this article is embarrassing. I seriously suggest revising it before you promote it. I'm not here to debate you; the comments to that for me, so don't @ me",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "me when im not going to say the earth is flat, im just going to edit together a bunch of quotes from scientists who seem to suggest that the earth is flat",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "marat is also maybe one of the single most biased sources you could have possibly chosen to contact abt this btw he has not been quiet about his support for the iof",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "im not saying youre antisemitic, im just asking you why you hate jewish people?? 0.0",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "This article can piss off",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "Truly an excellent example of uncritically working backwards from a conclusion you’ve already arrived at",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "ok i read part of the article and dog the authors of this article… are absolutely implying antisemitism",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "We're accusing the SJP of purposely centering their event around the Kristallnacht. This event was actually started by a completely different not-the-SJP organization, but we didn't know that until after we started writing this article, so we're leaving it in instead of maintaining our journalistic integrity. We're totally not accusing them of antisemitism.",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "This is seriously humiliating for an organization who ran for funding under the slogan \"Support truth",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "Anywayyyyy who's ready to write a letter to the editors!",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "Source? Made it the fuck up",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "source? well it proves my point",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "For any Quest people here, after the police issued the dispersal order, a good 50-75% of people on the skywalk, including myself, left the skywalk and returned downstairs to the plaza. To say \"none appeared to depart\" is entirely deceitful and, for an event that was highly attended and documented by people on this campus, you should've known better than to try lying through your teeth about it.",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "I called the quest that thursday night asking them why they were so insistent on publishing the next day and not giving SJP 24 hrs for a statement",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "they justified it with, the people should know the info we have on the event as soon as possible",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "I argued that they couldnt possibly have gotten the full story when they were standing across the street (behind the line of police)",
    "Type": "Falsehood"
  },
  {
    "File": "Discord copy paste",
    "Text": "they seemed to think that there were no possible details they could have been mistaken on or missed standing that far away, despite the fact I told them that when I was standing within eye view of them but even closer to the event itself, it was hard to tell what the fuck was going on",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "I asked them if they could tell me what kind of content they were going to attempt to publish, so that SJP could fill in details from people actually on the ground. they said any info they told SJP would have to be \"told to audrey",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "and that as constituents we should be getting the info at the same time as everyone else, despite being by far their best primary source",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "This is seriously so underhanded",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "If any of y'all would like to join me in writing a letter to the editors please do",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "not even they knew all the information when the article was published? jesus……..",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "I'm sure the actual SJP members are probably doing something already",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "I dont have the energy to keep reexplaining to the editors why they shouldnt have done this but Im happy to consult letters anybody else wants to write",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "godspeed reed sjp, gods strongest soldiers",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "I am accused of being in SJP, and i think I have a fairly reasonable understanding of the ongoing undercurrent of beef betwren the quest and sjp",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "more pressingly, I am absolutely not voting for declan, adrian, or sam in the upcoming elections",
    "Type": "Named"
  },
  {
    "File": "Discord copy paste",
    "Text": "which is extremely unfortunate because I do think there is a place for declan's understanding of data within the quest",
    "Type": "Named"
  },
  {
    "File": "Discord copy paste",
    "Text": "and that their knowledge on that is extremelt valuable",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "I know declan takes his job seriously which just makes it so disappointing to see such a serious lapse in judgment",
    "Type": "Named"
  },
  {
    "File": "Discord copy paste",
    "Text": "yeah. its just unfortunate when you take your job seriously but your standard is the new york times",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "And honestly, why would you expect Reedies of all people to not take a look at your writing more critically",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "Like we're not exactly known for not doing that lol",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "It's just a shame cuz I've really liked the quest, a lot of my friends work there, and it's very annoying to see none of them speak up and say \"hey, maybe openly lying about events at a protest is a bad idea",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "This November, the Quest received a national award for their coverage of Diversity, Equity and Inclusion issues - specifically Declan Bradley's article about economic diversity at Reed.\nhttps://reedquest.org/2023/11/04/quest-wins-national-award-for-dei-reporting-at-acp-fall-conference/\nImo, this DEI award was undeserved, even before the protest article. One look at the body of work produced by the all-white group of award recipients (for the most part representative of the entire staff) makes it clear that current news editors are relying on an inflammatory and dramatic rhetoric to represent our campus. Since any criticism of their journalistic integrity is met with counterpoints of having received various awards, I call for at least this recent certification to be revoked.",
    "Type": "Named"
  },
  {
    "File": "Discord copy paste",
    "Text": "Additionally,  I call for the authors - Declan, Adrian and Sam - to take some time away from writing news reports and return to writing non-news articles until they are better prepared for this responsibility, as it is clear from the limited edits to the protest article that the authors do not comprehend the gravity of their mistake. The interview, selected quotes and focal points of the photos are all heavily biased, with the aim of misrepresenting hundreds of Reedies attending the protest. However, I empathize with the stress they are going through right now and urge the student body to be kind in their criticisms - it is never okay to threaten someones life. There is plenty to find faulty in their journalism without the need for ad hominem attacks.",
    "Type": "Named"
  },
  {
    "File": "Discord copy paste",
    "Text": "It is disturbing that the authors of news reports published over the last few months, many about issues of DEI, are primarily white, non-Jewish, Cisgender men. Where are the voices from Muslim and Palestinian students, who have been traumatized by the unsafe environment on campus? Where is any semblance of giving other Reedies the benefit of the doubt? There is a marked deterioration in the objectivity of reporting compared to the Quest of the past that correlates with a decline in diversity.\nhttps://reedquest.org/staff/",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "You can reach info@studentpress.org and info@collegemedia.org to request they revoke the DEI award. I'm attaching a template email soon. I strongly urge the authors to pay attention to this criticism, and to stay safe.",
    "Type": "NA"
  },
  {
    "File": "Discord copy paste",
    "Text": "I am a concerned member of the Reed College Student body writing to strongly urge all parties to revoke the DEI award granted to the Quest newspaper at the ACP conference on Saturday, November 4th 2023. In light of their recent prejudiced news report regarding the Israel-Palestine conflict, published by Declan Bradley, Adrian Keller Feld, and Sam King on Saturday, November 11th, I strongly believe this award is no longer deserved. The disapproval of the student body regarding recent Quest coverage is evident from the vast majority of comments beneath the article, expressing dismay at its biased selection of an interview subject, mistakes related to its rushed publication, and flawed coverage of a protest through cherry-picked photos and quotes. Although several edits have been made to the original work after it was printed and distributed on campus, it remains a violation of the guiding principles that the Quest operates under, specifically maintaining objectivity and presenting both sides of a controversial issue.",
    "Type": "Named"
  }
]